---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLOpeningType
source: html/2b5920b2-fd0a-f3f1-02c1-74c6ce381336.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLOpeningType

This enumeration corresponds to the openingType attribute in gbXML
 and identifies the type of opening defined.

## Syntax (C#)
```csharp
public enum gbXMLOpeningType
```